---
type: TextBoxData
namespace: Autodesk.Revit.UI
version: 2024
members: 2
tags: [revit-api, class]
---

# TextBoxData

`Autodesk.Revit.UI.TextBoxData` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TextBoxData | 2011 | `public TextBoxData ( string name )` |
| Property | Image | 2011 | `public ImageSource Image { get ; set ; }` |